{
    "projects": [
        {
            "title": "Gradebook v2",
            "subtitle": "Elevating Tutor Tracking with NextJS & Firebase",
            "summary": "A robust platform tailored for tutors and educators to efficiently manage their student rosters. Features include the ability to add students, track and save assignments with associated grades and personalized feedback.  Streamlines the academic management process for educators, particularly those with a mixed student load.",
            "pic": "https://i.imgur.com/nFcV8sJ.png",
            "alttext": "Viewing a student's profile page",
            "gitlink": "https://github.com/gecitgit/gradebook",
            "livelink": "https://gradebook-eight.vercel.app/",
            "demovid": "https://www.youtube.com/",
            "id": 1
        },
        {
            "title": "MindLOG v2",
            "subtitle": "Visualizing Wellness: Your Mood's Best Friend!",
            "summary": "A comprehensive mood-tracking application that enables users to document their daily emotions, feelings, and notes in an online journal. Users can create detailed diary entries, with the added functionality of viewing an overview of their historical entries. The ‘stats’ section showcases six interactive graphs, providing a panoramic view of the user’s emotional journey.",
            "pic": "https://i.imgur.com/6eMuXr6.png",
            "alttext": "Viewing the stats page of the app",
            "gitlink": "https://github.com/gecitgit/mindlog-v2",
            "livelink": "https://mindlog.taulant.dev/",
            "demovid": "https://www.youtube.com/",
            "id": 2
        },
        {
            "title": "Animanga Search Pal",
            "subtitle": "Anime Queries, Simplified with JavaScript!",
            "summary": "A simple yet functional hobby project, aimed to illustrate proficiency in JavaScript. Users can explore and search for shows or manga on MyAnimeList using the Jikan API.  While primarily a platform to showcase raw JS skills, it also offers a streamlined experience for an anime enthusiast with custom CSS and efficient DOM manipulation.",
            "pic": "https://i.imgur.com/YBdrb8R.png",
            "alttext": "User browsing items they've added to their list",
            "gitlink": "https://github.com/gecitgit/animanga_v2",
            "livelink": "https://asp.taulant.dev/",
            "demovid": "https://www.youtube.com/",
            "id": 3
        }
    ]
}